sfproductlabs/ADuCM350/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM350/bsp/sys/adi_ADuCM350_typedefs.h
/* ==========================================================================
 *! \struct ADI_RTC_SS1LOWDUR_Struct
 *! \brief  RTC Auto-Reload Low Duration for SensorStrobe Channel 1 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_SS1LOWDUR_t__
typedef struct _ADI_RTC_SS1LOWDUR_t {
  union {
    struct {
      unsigned int SS1LOWDUR  : 16;  /**< Low Duration for SensorStrobe Channel 1. */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_SS1LOWDUR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_SS1LOWDUR_t__ */

/*@}*/

/** @defgroup SS2LOWDUR RTC Auto-Reload Low Duration for SensorStrobe Channel 2 (SS2LOWDUR) Register
 *  RTC Auto-Reload Low Duration for SensorStrobe Channel 2 (SS2LOWDUR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_SS2LOWDUR_Struct
 *! \brief  RTC Auto-Reload Low Duration for SensorStrobe Channel 2 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_SS2LOWDUR_t__
typedef struct _ADI_RTC_SS2LOWDUR_t {
  union {
    struct {
      unsigned int SS2LOWDUR  : 16;  /**< Low Duration for SensorStrobe Channel 2. */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_SS2LOWDUR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_SS2LOWDUR_t__ */

/*@}*/

/** @defgroup SS3LOWDUR RTC Auto-Reload Low Duration for SensorStrobe Channel 3 (SS3LOWDUR) Register
 *  RTC Auto-Reload Low Duration for SensorStrobe Channel 3 (SS3LOWDUR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_SS3LOWDUR_Struct
 *! \brief  RTC Auto-Reload Low Duration for SensorStrobe Channel 3 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_SS3LOWDUR_t__
typedef struct _ADI_RTC_SS3LOWDUR_t {
  union {
    struct {
      unsigned int SS3LOWDUR  : 16;  /**< Low Duration for SensorStrobe Channel 3. */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_SS3LOWDUR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_SS3LOWDUR_t__ */

/*@}*/

/** @defgroup SS1HIGHDUR RTC Auto-Reload High Duration for SensorStrobe Channel 1 (SS1HIGHDUR) Register
 *  RTC Auto-Reload High Duration for SensorStrobe Channel 1 (SS1HIGHDUR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_SS1HIGHDUR_Struct
 *! \brief  RTC Auto-Reload High Duration for SensorStrobe Channel 1 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_SS1HIGHDUR_t__
typedef struct _ADI_RTC_SS1HIGHDUR_t {
  union {
    struct {
      unsigned int SS1HIGHDUR : 16;  /**< High Duration for SensorStrobe Channel 1. */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_SS1HIGHDUR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_SS1HIGHDUR_t__ */

/*@}*/

/** @defgroup SS2HIGHDUR RTC Auto-Reload High Duration for SensorStrobe Channel 2 (SS2HIGHDUR) Register
 *  RTC Auto-Reload High Duration for SensorStrobe Channel 2 (SS2HIGHDUR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_SS2HIGHDUR_Struct
 *! \brief  RTC Auto-Reload High Duration for SensorStrobe Channel 2 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_SS2HIGHDUR_t__
typedef struct _ADI_RTC_SS2HIGHDUR_t {
  union {
    struct {
      unsigned int SS2HIGHDUR : 16;  /**< High Duration for SensorStrobe Channel 2. */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_SS2HIGHDUR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_SS2HIGHDUR_t__ */

/*@}*/

/** @defgroup SS3HIGHDUR RTC Auto-Reload High Duration for SensorStrobe Channel 3 (SS3HIGHDUR) Register
 *  RTC Auto-Reload High Duration for SensorStrobe Channel 3 (SS3HIGHDUR) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_SS3HIGHDUR_Struct
 *! \brief  RTC Auto-Reload High Duration for SensorStrobe Channel 3 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_SS3HIGHDUR_t__
typedef struct _ADI_RTC_SS3HIGHDUR_t {
  union {
    struct {
      unsigned int SS3HIGHDUR : 16;  /**< High Duration for SensorStrobe Channel 3. */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_SS3HIGHDUR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_SS3HIGHDUR_t__ */

/*@}*/

/** @defgroup SSMSKOT RTC Masks for SensorStrobe Channels on Time Control (SSMSKOT) Register
 *  RTC Masks for SensorStrobe Channels on Time Control (SSMSKOT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_SSMSKOT_Struct
 *! \brief  RTC Masks for SensorStrobe Channels on Time Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_SSMSKOT_t__
typedef struct _ADI_RTC_SSMSKOT_t {
  union {
    struct {
      unsigned int SS1MSKOT   :  4;  /**< Concatenation of Thermometer-encoded Masks for the 16-bit SensorStrobe Channels */
      unsigned int SS2MSKOT   :  4;  /**< SensorStrobe Channel 2 on Time Control */
      unsigned int SS3MSKOT   :  4;  /**< SensorStrobe Channel 3 on Time Control */
      unsigned int SS4MSKOT   :  4;  /**< SensorStrobe Channel 4 on Time Control */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_SSMSKOT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_SSMSKOT_t__ */

/*@}*/

/** @defgroup CR5SSS RTC Control 5 for Configuring SensorStrobe Channel GPIO Sampling (CR5SSS) Register
 *  RTC Control 5 for Configuring SensorStrobe Channel GPIO Sampling (CR5SSS) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_CR5SSS_Struct
 *! \brief  RTC Control 5 for Configuring SensorStrobe Channel GPIO Sampling Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_CR5SSS_t__
typedef struct _ADI_RTC_CR5SSS_t {
  union {
    struct {
      unsigned int SS1SMPEN   :  3;  /**< GPIO Input Sample Enable for SensorStrobe Channel 1 */
      unsigned int SS1SMPMTCHIRQEN :  1;  /**< Sample Activity Interrupt Enable for SensorStrobe Channel 1 */
      unsigned int SS2SMPEN        :  3;  /**< GPIO Input Sample Enable for SensorStrobe Channel 2 */
      unsigned int SS2SMPMTCHIRQEN :  1;  /**< Sample Activity Interrupt Enable for SensorStrobe Channel 2 */
      unsigned int SS3SMPEN        :  3;  /**< GPIO Input Sample Enable for SensorStrobe Channel 3 */
      unsigned int SS3SMPMTCHIRQEN :  1;  /**< Sample Activity Interrupt Enable for SensorStrobe Channel 3 */
      unsigned int reserved12      :  4;
    };
    uint16_t VALUE16;
  };
} ADI_RTC_CR5SSS_t;
