sfproductlabs/ADuCM350/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM350/bsp/sys/adi_ADuCM350_typedefs.h
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_CR5SSS_t__ */

/*@}*/

/** @defgroup CR6SSS RTC Control 6 for Configuring SensorStrobe Channel GPIO Sampling Edge (CR6SSS) Register
 *  RTC Control 6 for Configuring SensorStrobe Channel GPIO Sampling Edge (CR6SSS) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_RTC_CR6SSS_SS1SMPONFE
 *! \brief  GPIO Sample Around Falling Edge of SensorStrobe Channel 1 (SS1SMPONFE) Enumerations
 *  ========================================================================= */
typedef enum
{
  RTC_CR6SSS_SS1NOFES = 0,  /**< No sampling of input around falling edge                                        */
  RTC_CR6SSS_SS1BFES  = 1,  /**< Input sampled one clock cycle before falling edge of the SensorStrobe channel 1 */
  RTC_CR6SSS_SS1FES   = 2,  /**< Input sampled at falling edge of the SensorStrobe channel 1                     */
  RTC_CR6SSS_SS1AFES  = 3   /**< Input sampled one clock cycle after falling edge of the SensorStrobe channel 1  */
} ADI_RTC_CR6SSS_SS1SMPONFE;


/*  =========================================================================
 *! \enum   ADI_RTC_CR6SSS_SS1SMPONRE
 *! \brief  GPIO Sample Around Rising Edge of SensorStrobe Channel 1 (SS1SMPONRE) Enumerations
 *  ========================================================================= */
typedef enum
{
  RTC_CR6SSS_SS1NORES = 0,  /**< No sampling of input around rising edge                                        */
  RTC_CR6SSS_SS1BRES  = 1,  /**< Input sampled one clock cycle before rising edge of the SensorStrobe channel 1 */
  RTC_CR6SSS_SS1RES   = 2,  /**< Input sampled at rising edge of the SensorStrobe channel 1                     */
  RTC_CR6SSS_SS1ARES  = 3   /**< Input sampled one clock cycle after rising edge of the SensorStrobe channel 1  */
} ADI_RTC_CR6SSS_SS1SMPONRE;


/*  =========================================================================
 *! \enum   ADI_RTC_CR6SSS_SS2SMPONFE
 *! \brief  GPIO Sample Around Falling Edge of SensorStrobe Channel 2 (SS2SMPONFE) Enumerations
 *  ========================================================================= */
typedef enum
{
  RTC_CR6SSS_SS2NOFES = 0,  /**< No sampling of input around falling edge                                        */
  RTC_CR6SSS_SS2BFES  = 1,  /**< Input sampled one clock cycle before falling edge of the SensorStrobe channel 2 */
  RTC_CR6SSS_SS2FES   = 2,  /**< Input sampled at falling edge of the SensorStrobe channel 2                     */
  RTC_CR6SSS_SS2AFES  = 3   /**< Input sampled one clock cycle after falling edge of the SensorStrobe channel 2  */
} ADI_RTC_CR6SSS_SS2SMPONFE;


/*  =========================================================================
 *! \enum   ADI_RTC_CR6SSS_SS2SMPONRE
 *! \brief  GPIO Sample Around Rising Edge of SensorStrobe Channel 2 (SS2SMPONRE) Enumerations
 *  ========================================================================= */
typedef enum
{
  RTC_CR6SSS_SS2NORES = 0,  /**< No sampling of input around rising edge                                        */
  RTC_CR6SSS_SS2BRES  = 1,  /**< Input sampled one clock cycle before rising edge of the SensorStrobe channel 2 */
  RTC_CR6SSS_SS2RES   = 2,  /**< Input sampled at rising edge of the SensorStrobe channel 2                     */
  RTC_CR6SSS_SS2ARES  = 3   /**< Input sampled one clock cycle after rising edge of the SensorStrobe channel 2  */
} ADI_RTC_CR6SSS_SS2SMPONRE;


/*  =========================================================================
 *! \enum   ADI_RTC_CR6SSS_SS3SMPONFE
 *! \brief  GPIO Sample Around Falling Edge of SensorStrobe Channel 3 (SS3SMPONFE) Enumerations
 *  ========================================================================= */
typedef enum
{
  RTC_CR6SSS_SS3NOFES = 0,  /**< No sampling of input around falling edge                                        */
  RTC_CR6SSS_SS3BFES  = 1,  /**< Input sampled one clock cycle before falling edge of the SensorStrobe channel 3 */
  RTC_CR6SSS_SS3FES   = 2,  /**< Input sampled at falling edge of the SensorStrobe channel 3                     */
  RTC_CR6SSS_SS3AFES  = 3   /**< Input sampled one clock cycle after falling edge of the SensorStrobe channel 3  */
} ADI_RTC_CR6SSS_SS3SMPONFE;


/*  =========================================================================
 *! \enum   ADI_RTC_CR6SSS_SS3SMPONRE
 *! \brief  GPIO Sample Around Rising Edge of SensorStrobe Channel 3 (SS3SMPONRE) Enumerations
 *  ========================================================================= */
typedef enum
{
  RTC_CR6SSS_SS3NORES = 0,  /**< No sampling of input around rising edge                                        */
  RTC_CR6SSS_SS3BRES  = 1,  /**< Input sampled one clock cycle before rising edge of the SensorStrobe channel 3 */
  RTC_CR6SSS_SS3RES   = 2,  /**< Input sampled at rising edge of the SensorStrobe channel 3                     */
  RTC_CR6SSS_SS3ARES  = 3   /**< Input sampled one clock cycle after rising edge of the SensorStrobe channel 3  */
} ADI_RTC_CR6SSS_SS3SMPONRE;


/* ==========================================================================
 *! \struct ADI_RTC_CR6SSS_Struct
 *! \brief  RTC Control 6 for Configuring SensorStrobe Channel GPIO Sampling Edge Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_CR6SSS_t__
typedef struct _ADI_RTC_CR6SSS_t {
  union {
    struct {
      unsigned int SS1SMPONFE :  2;  /**< GPIO Sample Around Falling Edge of SensorStrobe Channel 1 */
      unsigned int SS1SMPONRE :  2;  /**< GPIO Sample Around Rising Edge of SensorStrobe Channel 1 */
      unsigned int SS2SMPONFE :  2;  /**< GPIO Sample Around Falling Edge of SensorStrobe Channel 2 */
      unsigned int SS2SMPONRE :  2;  /**< GPIO Sample Around Rising Edge of SensorStrobe Channel 2 */
      unsigned int SS3SMPONFE :  2;  /**< GPIO Sample Around Falling Edge of SensorStrobe Channel 3 */
      unsigned int SS3SMPONRE :  2;  /**< GPIO Sample Around Rising Edge of SensorStrobe Channel 3 */
      unsigned int reserved12 :  4;
    };
    uint16_t VALUE16;
  };
} ADI_RTC_CR6SSS_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_CR6SSS_t__ */

/*@}*/

/** @defgroup CR7SSS RTC Control 7 for Configuring SensorStrobe Channel GPIO Sampling Activity (CR7SSS) Register
 *  RTC Control 7 for Configuring SensorStrobe Channel GPIO Sampling Activity (CR7SSS) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_RTC_CR7SSS_SS1SMPPTRN
 *! \brief  Sample Activity Selection for SensorStrobe Channel 1 (SS1SMPPTRN) Enumerations
 *  ========================================================================= */
typedef enum
{
  RTC_CR7SSS_SS1SMPCHNG   = 0,  /**< Current GPIO sample is not same as previous sample */
  RTC_CR7SSS_SS1SMPSAME   = 1,  /**< Current GPIO sample is same as previous sample     */
  RTC_CR7SSS_SS1SMPMTCH   = 2,  /**< Current GPIO sample is same as expected sample     */
  RTC_CR7SSS_SS1SMPNOMTCH = 3   /**< Current GPIO sample is not same as expected sample */
} ADI_RTC_CR7SSS_SS1SMPPTRN;


/*  =========================================================================
 *! \enum   ADI_RTC_CR7SSS_SS2SMPPTRN
 *! \brief  Sample Activity Selection for SensorStrobe Channel 2 (SS2SMPPTRN) Enumerations
 *  ========================================================================= */
typedef enum
{
  RTC_CR7SSS_SS2SMPCHNG   = 0,  /**< Current GPIO sample is not same as previous sample */
  RTC_CR7SSS_SS2SMPSAME   = 1,  /**< Current GPIO sample is same as previous sample     */
  RTC_CR7SSS_SS2SMPMTCH   = 2,  /**< Current GPIO sample is same as expected sample     */
  RTC_CR7SSS_SS2SMPNOMTCH = 3   /**< Current GPIO sample is not same as expected sample */
} ADI_RTC_CR7SSS_SS2SMPPTRN;


/*  =========================================================================
 *! \enum   ADI_RTC_CR7SSS_SS3SMPPTRN
 *! \brief  Sample Activity Selection for SensorStrobe Channel 3 (SS3SMPPTRN) Enumerations
 *  ========================================================================= */
typedef enum
{
  RTC_CR7SSS_SS3SMPCHNG   = 0,  /**< Current GPIO sample is not same as previous sample */
  RTC_CR7SSS_SS3SMPSAME   = 1,  /**< Current GPIO sample is same as previous sample     */
  RTC_CR7SSS_SS3SMPMTCH   = 2,  /**< Current GPIO sample is same as expected sample     */
  RTC_CR7SSS_SS3SMPNOMTCH = 3   /**< Current GPIO sample is not same as expected sample */
} ADI_RTC_CR7SSS_SS3SMPPTRN;


