sfproductlabs/ADuCM350/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM350/bsp/sys/adi_ADuCM350_typedefs.h
/* ==========================================================================
 *! \struct ADI_RTC_CR7SSS_Struct
 *! \brief  RTC Control 7 for Configuring SensorStrobe Channel GPIO Sampling Activity Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_CR7SSS_t__
typedef struct _ADI_RTC_CR7SSS_t {
  union {
    struct {
      unsigned int SS1SMPEXP  :  3;  /**< Expected GPIO Sample for SensorStrobe Channel 1 */
      unsigned int SS1SMPPTRN :  2;  /**< Sample Activity Selection for SensorStrobe Channel 1 */
      unsigned int SS2SMPEXP  :  3;  /**< Expected GPIO Sample for SensorStrobe Channel 2 */
      unsigned int SS2SMPPTRN :  2;  /**< Sample Activity Selection for SensorStrobe Channel 2 */
      unsigned int SS3SMPEXP  :  3;  /**< Expected GPIO Sample for SensorStrobe Channel 3 */
      unsigned int SS3SMPPTRN :  2;  /**< Sample Activity Selection for SensorStrobe Channel 3 */
      unsigned int reserved15 :  1;
    };
    uint16_t VALUE16;
  };
} ADI_RTC_CR7SSS_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_CR7SSS_t__ */

/*@}*/

/** @defgroup SR7 RTC Status 7 (SR7) Register
 *  RTC Status 7 (SR7) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_SR7_Struct
 *! \brief  RTC Status 7 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_SR7_t__
typedef struct _ADI_RTC_SR7_t {
  union {
    struct {
      unsigned int SS1SMP     :  3;  /**< Latest GPIO Sample for SensorStrobe Channel 1 */
      unsigned int SS1SMPMTCHIRQ :  1;  /**< Sticky Status of GPIO Sample Pattern Match for SensorStrobe Channel 1 */
      unsigned int SS2SMP        :  3;  /**< Latest GPIO Sample for SensorStrobe Channel 2 */
      unsigned int SS2SMPMTCHIRQ :  1;  /**< Sticky Status of GPIO Sample Pattern Match for SensorStrobe Channel 2 */
      unsigned int SS3SMP        :  3;  /**< Latest GPIO Sample for SensorStrobe Channel 3 */
      unsigned int SS3SMPMTCHIRQ :  1;  /**< Sticky Status of GPIO Sample Pattern Match for SensorStrobe Channel 3 */
      unsigned int SS1OUT        :  1;  /**< Output Value for SensorStrobe Channel 1 */
      unsigned int SS2OUT        :  1;  /**< Output Value for SensorStrobe Channel 2 */
      unsigned int SS3OUT        :  1;  /**< Output Value for SensorStrobe Channel 3 */
      unsigned int SS4OUT        :  1;  /**< Output Value for SensorStrobe Channel 4 */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_SR7_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_SR7_t__ */

/*@}*/

/** @defgroup SR8 RTC Status 8 (SR8) Register
 *  RTC Status 8 (SR8) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_SR8_Struct
 *! \brief  RTC Status 8 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_SR8_t__
typedef struct _ADI_RTC_SR8_t {
  union {
    struct {
      unsigned int WSYNCSS1LOWDUR :  1;  /**< Synchronisation Status of Posted Writes to SensorStrobe Channel 1 Low Duration Register */
      unsigned int WSYNCSS2LOWDUR :  1;  /**< Synchronisation Status of Posted Writes to SensorStrobe Channel 2 Low Duration Register */
      unsigned int WSYNCSS3LOWDUR :  1;  /**< Synchronisation Status of Posted Writes to SensorStrobe Channel 3 Low Duration Register */
      unsigned int reserved3       :  1;
      unsigned int WSYNCSS1HIGHDUR :  1;  /**< Synchronisation Status of Posted Writes to SensorStrobe Channel 1 High Duration Register */
      unsigned int WSYNCSS2HIGHDUR :  1;  /**< Synchronisation Status of Posted Writes to SensorStrobe Channel 2 High Duration Register */
      unsigned int WSYNCSS3HIGHDUR :  1;  /**< Synchronisation Status of Posted Writes to SensorStrobe Channel 3 High Duration Register */
      unsigned int reserved7       :  1;
      unsigned int WSYNCCR5SSS     :  1;  /**< Synchronisation Status of Posted Writes to Control 5 for Configuring SensorStrobe Channel Register */
      unsigned int WSYNCCR6SSS     :  1;  /**< Synchronisation Status of Posted Writes to Control 6 for Configuring SensorStrobe Channel Register */
      unsigned int WSYNCCR7SSS     :  1;  /**< Synchronisation Status of Posted Writes to Control 7 for Configuring SensorStrobe Channel Register */
      unsigned int WSYNCSR7        :  1;  /**< Synchronisation Status of Posted Writes to Status 7 Register */
      unsigned int WSYNCGPMUX0     :  1;  /**< Synchronisation Status of Posted Writes to GPIO Pin Mux Control Register 0 */
      unsigned int WSYNCGPMUX1     :  1;  /**< Synchronisation Status of Posted Writes to GPIO Pin Mux Control Register 1 */
      unsigned int reserved14      :  2;
    };
    uint16_t VALUE16;
  };
} ADI_RTC_SR8_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_SR8_t__ */

/*@}*/

/** @defgroup SR9 RTC Status 9 (SR9) Register
 *  RTC Status 9 (SR9) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_SR9_Struct
 *! \brief  RTC Status 9 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_SR9_t__
typedef struct _ADI_RTC_SR9_t {
  union {
    struct {
      unsigned int WPENDSS1LOWDUR :  1;  /**< Pending Status of Posted Writes to SensortStrobe Channel 1 Low Duration Register */
      unsigned int WPENDSS2LOWDUR :  1;  /**< Pending Status of Posted Writes to SensortStrobe Channel 2 Low Duration Register */
      unsigned int WPENDSS3LOWDUR :  1;  /**< Pending Status of Posted Writes to SensortStrobe Channel 3 Low Duration Register */
      unsigned int reserved3       :  1;
      unsigned int WPENDSS1HIGHDUR :  1;  /**< Pending Status of Posted Writes to SensortStrobe Channel 1 High Duration Register */
      unsigned int WPENDSS2HIGHDUR :  1;  /**< Pending Status of Posted Writes to SensortStrobe Channel 2 High Duration Register */
      unsigned int WPENDSS3HIGHDUR :  1;  /**< Pending Status of Posted Writes to SensortStrobe Channel 3 High Duration Register */
      unsigned int reserved7       :  1;
      unsigned int WPENDCR5SSS     :  1;  /**< Pending Status of Posted Writes to Control 5 for Configuring SensorStrobe Channel Register */
      unsigned int WPENDCR6SSS     :  1;  /**< Pending Status of Posted Writes to Control 6 for Configuring SensorStrobe Channel Register */
      unsigned int WPENDCR7SSS     :  1;  /**< Pending Status of Posted Writes to Control 7 for Configuring SensorStrobe Channel Register */
      unsigned int WPENDSR7        :  1;  /**< Pending Status of Posted Writes to SR7 */
      unsigned int WPENDGPMUX0     :  1;  /**< Pending Status of Posted Writes to GPMUX0 */
      unsigned int WPENDGPMUX1     :  1;  /**< Pending Status of Posted Writes to  GPMUX1 */
      unsigned int reserved14      :  2;
    };
    uint16_t VALUE16;
  };
} ADI_RTC_SR9_t;
