sfproductlabs/ADuCM350/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM350/bsp/sys/adi_ADuCM350_typedefs.h
/* ==========================================================================
 *! \struct ADI_ADC_AVG_CFG_Struct
 *! \brief  Averaging Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_ADC_AVG_CFG_t__
typedef struct _ADI_ADC_AVG_CFG_t {
  union {
    struct {
      unsigned int FACTOR     :  8;  /**< Program averaging factor for averaging enabled channels (1-256) */
      unsigned int reserved8  :  6;
      unsigned int OS         :  1;  /**< Enable oversampling */
      unsigned int EN         :  1;  /**< To enable averaging on Channels enabled in enable register */
    };
    uint16_t VALUE16;
  };
} ADI_ADC_AVG_CFG_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_ADC_AVG_CFG_t__ */

/*@}*/

/** @defgroup IRQ_EN Interrupt Enable (IRQ_EN) Register
 *  Interrupt Enable (IRQ_EN) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_ADC_IRQ_EN_Struct
 *! \brief  Interrupt Enable Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_ADC_IRQ_EN_t__
typedef struct _ADI_ADC_IRQ_EN_t {
  union {
    struct {
      unsigned int CNVDONE    :  1;  /**< Set it to enable interrupt after conversion is done */
      unsigned int reserved1  :  9;
      unsigned int CALDONE    :  1;  /**< Set it to enable interrupt for calibration done */
      unsigned int OVF        :  1;  /**< Set to enable interrupt in case of overflow */
      unsigned int ALERT      :  1;  /**< Set to enable interrupt on crossing lower or higher limit */
      unsigned int RDY        :  1;  /**< Set to enable interrupt when ADC is ready to convert */
      unsigned int reserved14 :  2;
    };
    uint16_t VALUE16;
  };
} ADI_ADC_IRQ_EN_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_ADC_IRQ_EN_t__ */

/*@}*/

/** @defgroup STAT ADC Status (STAT) Register
 *  ADC Status (STAT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_ADC_STAT_Struct
 *! \brief  ADC Status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_ADC_STAT_t__
typedef struct _ADI_ADC_STAT_t {
  union {
    struct {
      unsigned int DONE0      :  1;  /**< Indicates conversion done on Channel 0 */
      unsigned int DONE1      :  1;  /**< Indicates conversion done on Channel 1 */
      unsigned int DONE2      :  1;  /**< Indicates conversion done on Channel 2 */
      unsigned int DONE3      :  1;  /**< Indicates conversion done on Channel 3 */
      unsigned int DONE4      :  1;  /**< Indicates conversion done on Channel 4 */
      unsigned int DONE5      :  1;  /**< Indicates conversion done on Channel 5 */
      unsigned int DONE6      :  1;  /**< Indicates conversion done on Channel 6 */
      unsigned int DONE7      :  1;  /**< Indicates conversion done on Channel 7 */
      unsigned int BATDONE    :  1;  /**< Indicates conversion done for battery monitoring */
      unsigned int TMPDONE    :  1;  /**< Indicates conversion is done for temperature sensing */
      unsigned int TMP2DONE   :  1;  /**< Indicates conversion is done for temperature sensing 2 */
      unsigned int reserved11 :  3;
      unsigned int CALDONE    :  1;  /**< Indicates calibration is done */
      unsigned int RDY        :  1;  /**< Indicates ADC is ready to start converting, when using external reference buffer */
    };
    uint16_t VALUE16;
  };
} ADI_ADC_STAT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_ADC_STAT_t__ */

/*@}*/

/** @defgroup OVF Overflow of Output Registers (OVF) Register
 *  Overflow of Output Registers (OVF) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_ADC_OVF_Struct
 *! \brief  Overflow of Output Registers Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_ADC_OVF_t__
typedef struct _ADI_ADC_OVF_t {
  union {
    struct {
      unsigned int CH0        :  1;  /**< Indicates overflow in channel 0 output register */
      unsigned int CH1        :  1;  /**< Indicates overflow in channel 1 output register */
      unsigned int CH2        :  1;  /**< Indicates overflow in channel 2 output register */
      unsigned int CH3        :  1;  /**< Indicates overflow in channel 3 output register */
      unsigned int CH4        :  1;  /**< Indicates overflow in channel 4 output register */
      unsigned int CH5        :  1;  /**< Indicates overflow in channel 5 output register */
      unsigned int CH6        :  1;  /**< Indicates overflow in channel 6 output register */
      unsigned int CH7        :  1;  /**< Indicates overflow in channel 7 output register */
      unsigned int BAT        :  1;  /**< Indicates overflow in battery monitoring output register */
      unsigned int TMP        :  1;  /**< Indicates overflow in temperature output register */
      unsigned int TMP2       :  1;  /**< Indicates overflow in temperature 2 output register */
      unsigned int reserved11 :  5;
    };
    uint16_t VALUE16;
  };
} ADI_ADC_OVF_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_ADC_OVF_t__ */

/*@}*/

/** @defgroup ALERT Alert Indication (ALERT) Register
 *  Alert Indication (ALERT) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_ADC_ALERT_Struct
 *! \brief  Alert Indication Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_ADC_ALERT_t__
typedef struct _ADI_ADC_ALERT_t {
  union {
    struct {
      unsigned int HI0        :  1;  /**< Channel 0 High alert status */
      unsigned int LO0        :  1;  /**< Channel 0 Low alert status */
      unsigned int HI1        :  1;  /**< Channel 1 High alert status */
      unsigned int LO1        :  1;  /**< Channel 1 Low alert status */
      unsigned int HI2        :  1;  /**< Channel 2 High alert status */
      unsigned int LO2        :  1;  /**< Channel 2 Low alert status */
      unsigned int HI3        :  1;  /**< Channel 3 High alert status */
      unsigned int LO3        :  1;  /**< Channel 3 Low alert status */
      unsigned int reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_ADC_ALERT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_ADC_ALERT_t__ */

/*@}*/

/** @defgroup CH0_OUT Conversion Result Channel 0 (CH0_OUT) Register
 *  Conversion Result Channel 0 (CH0_OUT) Register.
 *  @{
 */

