sfproductlabs/ADuCM350/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM350/bsp/sys/adi_ADuCM350_typedefs.h
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_SHAH6_t__ */

/*@}*/

/** @defgroup SHAH7 SHA Bits [255:224] (SHAH7) Register
 *  SHA Bits [255:224] (SHAH7) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_SHAH7_Struct
 *! \brief  SHA Bits [255:224] Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_SHAH7_t__
typedef struct _ADI_CRYPT_SHAH7_t {
  union {
    struct {
      unsigned int SHAHASH7   : 32;  /**< Word 7: SHA Hash */
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_SHAH7_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_SHAH7_t__ */

/*@}*/

/** @defgroup SHA_LAST_WORD SHA Last Word and Valid Bits Information (SHA_LAST_WORD) Register
 *  SHA Last Word and Valid Bits Information (SHA_LAST_WORD) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_SHA_LAST_WORD_Struct
 *! \brief  SHA Last Word and Valid Bits Information Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_SHA_LAST_WORD_t__
typedef struct _ADI_CRYPT_SHA_LAST_WORD_t {
  union {
    struct {
      unsigned int O_Last_Word :  1;  /**< Last SHA Input Word */
      unsigned int O_Bits_Valid :  5;  /**< Bits Valid in SHA Last Word Input */
      unsigned int reserved6    : 26;
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_SHA_LAST_WORD_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_SHA_LAST_WORD_t__ */

/*@}*/

/** @defgroup CCM_NUM_VALID_BYTES NUM_VALID_BYTES (CCM_NUM_VALID_BYTES) Register
 *  NUM_VALID_BYTES (CCM_NUM_VALID_BYTES) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_CCM_NUM_VALID_BYTES_Struct
 *! \brief  NUM_VALID_BYTES Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_CCM_NUM_VALID_BYTES_t__
typedef struct _ADI_CRYPT_CCM_NUM_VALID_BYTES_t {
  union {
    struct {
      unsigned int NUM_VALID_BYTES :  4;  /**< Number of Valid Bytes in CCM Last Data */
      unsigned int reserved4       : 28;
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_CCM_NUM_VALID_BYTES_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_CCM_NUM_VALID_BYTES_t__ */

/*@}*/

/** @defgroup PRKSTORCFG PRKSTOR Configuration (PRKSTORCFG) Register
 *  PRKSTOR Configuration (PRKSTORCFG) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_PRKSTORCFG_Struct
 *! \brief  PRKSTOR Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_PRKSTORCFG_t__
typedef struct _ADI_CRYPT_PRKSTORCFG_t {
  union {
    struct {
      unsigned int KEY_INDEX  :  7;  /**< Index of Key in PRKSTOR */
      unsigned int CMD        :  4;  /**< Command Input for PRKSTOR */
      unsigned int reserved11 : 21;
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_PRKSTORCFG_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_PRKSTORCFG_t__ */

/*@}*/

/** @defgroup KUW0 Key Wrap Unwrap Register 0 (KUW0) Register
 *  Key Wrap Unwrap Register 0 (KUW0) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_KUW0_Struct
 *! \brief  Key Wrap Unwrap Register 0 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW0_t__
typedef struct _ADI_CRYPT_KUW0_t {
  union {
    struct {
      unsigned int KUW0       : 32;  /**< KUW [31:0] */
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_KUW0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW0_t__ */

/*@}*/

/** @defgroup KUW1 Key Wrap Unwrap Register 1 (KUW1) Register
 *  Key Wrap Unwrap Register 1 (KUW1) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_KUW1_Struct
 *! \brief  Key Wrap Unwrap Register 1 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW1_t__
typedef struct _ADI_CRYPT_KUW1_t {
  union {
    struct {
      unsigned int KUW1       : 32;  /**< KUW [63:32] */
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_KUW1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW1_t__ */

/*@}*/

/** @defgroup KUW2 Key Wrap Unwrap Register 2 (KUW2) Register
 *  Key Wrap Unwrap Register 2 (KUW2) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_KUW2_Struct
 *! \brief  Key Wrap Unwrap Register 2 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW2_t__
typedef struct _ADI_CRYPT_KUW2_t {
  union {
    struct {
      unsigned int KUW2       : 32;  /**< KUW [95:64] */
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_KUW2_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW2_t__ */

/*@}*/

/** @defgroup KUW3 Key Wrap Unwrap Register 3 (KUW3) Register
 *  Key Wrap Unwrap Register 3 (KUW3) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_KUW3_Struct
 *! \brief  Key Wrap Unwrap Register 3 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW3_t__
typedef struct _ADI_CRYPT_KUW3_t {
  union {
    struct {
      unsigned int KUW3       : 32;  /**< KUW [127:96] */
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_KUW3_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW3_t__ */

/*@}*/

/** @defgroup KUW4 Key Wrap Unwrap Register 4 (KUW4) Register
 *  Key Wrap Unwrap Register 4 (KUW4) Register.
 *  @{
 */

