sfproductlabs/ADuCM350/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM350/bsp/sys/adi_ADuCM350_typedefs.h
/* ==========================================================================
 *! \struct ADI_CRYPT_KUW4_Struct
 *! \brief  Key Wrap Unwrap Register 4 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW4_t__
typedef struct _ADI_CRYPT_KUW4_t {
  union {
    struct {
      unsigned int KUW4       : 32;  /**< KUW [159:128] */
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_KUW4_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW4_t__ */

/*@}*/

/** @defgroup KUW5 Key Wrap Unwrap Register 5 (KUW5) Register
 *  Key Wrap Unwrap Register 5 (KUW5) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_KUW5_Struct
 *! \brief  Key Wrap Unwrap Register 5 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW5_t__
typedef struct _ADI_CRYPT_KUW5_t {
  union {
    struct {
      unsigned int KUW5       : 32;  /**< KUW [191:160] */
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_KUW5_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW5_t__ */

/*@}*/

/** @defgroup KUW6 Key Wrap Unwrap Register 6 (KUW6) Register
 *  Key Wrap Unwrap Register 6 (KUW6) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_KUW6_Struct
 *! \brief  Key Wrap Unwrap Register 6 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW6_t__
typedef struct _ADI_CRYPT_KUW6_t {
  union {
    struct {
      unsigned int KUW6       : 32;  /**< KUW [223:192] */
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_KUW6_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW6_t__ */

/*@}*/

/** @defgroup KUW7 Key Wrap Unwrap Register 7 (KUW7) Register
 *  Key Wrap Unwrap Register 7 (KUW7) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_KUW7_Struct
 *! \brief  Key Wrap Unwrap Register 7 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW7_t__
typedef struct _ADI_CRYPT_KUW7_t {
  union {
    struct {
      unsigned int KUW7       : 32;  /**< KUW [255:224] */
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_KUW7_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW7_t__ */

/*@}*/

/** @defgroup KUW8 Key Wrap Unwrap Register 8 (KUW8) Register
 *  Key Wrap Unwrap Register 8 (KUW8) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_KUW8_Struct
 *! \brief  Key Wrap Unwrap Register 8 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW8_t__
typedef struct _ADI_CRYPT_KUW8_t {
  union {
    struct {
      unsigned int KUW8       : 32;  /**< KUW [287:256] */
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_KUW8_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW8_t__ */

/*@}*/

/** @defgroup KUW9 Key Wrap Unwrap Register 9 (KUW9) Register
 *  Key Wrap Unwrap Register 9 (KUW9) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_KUW9_Struct
 *! \brief  Key Wrap Unwrap Register 9 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW9_t__
typedef struct _ADI_CRYPT_KUW9_t {
  union {
    struct {
      unsigned int KUW9       : 32;  /**< KUW [319:288] */
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_KUW9_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW9_t__ */

/*@}*/

/** @defgroup KUW10 Key Wrap Unwrap Register 10 (KUW10) Register
 *  Key Wrap Unwrap Register 10 (KUW10) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_KUW10_Struct
 *! \brief  Key Wrap Unwrap Register 10 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW10_t__
typedef struct _ADI_CRYPT_KUW10_t {
  union {
    struct {
      unsigned int KUW10      : 32;  /**< KUW [351:320] */
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_KUW10_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW10_t__ */

/*@}*/

/** @defgroup KUW11 Key Wrap Unwrap Register 11 (KUW11) Register
 *  Key Wrap Unwrap Register 11 (KUW11) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_KUW11_Struct
 *! \brief  Key Wrap Unwrap Register 11 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW11_t__
typedef struct _ADI_CRYPT_KUW11_t {
  union {
    struct {
      unsigned int KUW11      : 32;  /**< KUW [383:352] */
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_KUW11_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW11_t__ */

/*@}*/

/** @defgroup KUW12 Key Wrap Unwrap Register 12 (KUW12) Register
 *  Key Wrap Unwrap Register 12 (KUW12) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_KUW12_Struct
 *! \brief  Key Wrap Unwrap Register 12 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW12_t__
typedef struct _ADI_CRYPT_KUW12_t {
  union {
    struct {
      unsigned int KUW12      : 32;  /**< KUW [415:384] */
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_KUW12_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW12_t__ */

/*@}*/

/** @defgroup KUW13 Key Wrap Unwrap Register 13 (KUW13) Register
 *  Key Wrap Unwrap Register 13 (KUW13) Register.
 *  @{
 */

