sfproductlabs/ADuCM350/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM350/bsp/sys/adi_ADuCM350_typedefs.h
/* ==========================================================================
 *! \struct ADI_CRYPT_KUW13_Struct
 *! \brief  Key Wrap Unwrap Register 13 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW13_t__
typedef struct _ADI_CRYPT_KUW13_t {
  union {
    struct {
      unsigned int KUW13      : 32;  /**< KUW [447:416] */
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_KUW13_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW13_t__ */

/*@}*/

/** @defgroup KUW14 Key Wrap Unwrap Register 14 (KUW14) Register
 *  Key Wrap Unwrap Register 14 (KUW14) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_KUW14_Struct
 *! \brief  Key Wrap Unwrap Register 14 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW14_t__
typedef struct _ADI_CRYPT_KUW14_t {
  union {
    struct {
      unsigned int KUW14      : 32;  /**< KUW [479:448] */
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_KUW14_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW14_t__ */

/*@}*/

/** @defgroup KUW15 Key Wrap Unwrap Register 15 (KUW15) Register
 *  Key Wrap Unwrap Register 15 (KUW15) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_KUW15_Struct
 *! \brief  Key Wrap Unwrap Register 15 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW15_t__
typedef struct _ADI_CRYPT_KUW15_t {
  union {
    struct {
      unsigned int KUW15      : 32;  /**< KUW [511:480] */
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_KUW15_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_KUW15_t__ */

/*@}*/

/** @defgroup KUWValStr1 Key Wrap Unwrap Validation String [63:32] (KUWValStr1) Register
 *  Key Wrap Unwrap Validation String [63:32] (KUWValStr1) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_KUWValStr1_Struct
 *! \brief  Key Wrap Unwrap Validation String [63:32] Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_KUWValStr1_t__
typedef struct _ADI_CRYPT_KUWValStr1_t {
  union {
    struct {
      unsigned int InitalValue0 : 32;  /**< Initial Value */
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_KUWValStr1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_KUWValStr1_t__ */

/*@}*/

/** @defgroup KUWValStr2 Key Wrap Unwrap Validation String [31:0] (KUWValStr2) Register
 *  Key Wrap Unwrap Validation String [31:0] (KUWValStr2) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CRYPT_KUWValStr2_Struct
 *! \brief  Key Wrap Unwrap Validation String [31:0] Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_KUWValStr2_t__
typedef struct _ADI_CRYPT_KUWValStr2_t {
  union {
    struct {
      unsigned int InitialValue1 : 32;  /**< Initial Value */
    };
    uint32_t VALUE32;
  };
} ADI_CRYPT_KUWValStr2_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRYPT_KUWValStr2_t__ */

/*@}*/

/** @defgroup IEN Power Supply Monitor Interrupt Enable (IEN) Register
 *  Power Supply Monitor Interrupt Enable (IEN) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_PMG_IEN_RANGEBAT
 *! \brief  Battery Monitor Range (RANGEBAT) Enumerations
 *  ========================================================================= */
typedef enum
{
  PMG_IEN_REGION1 = 0,  /**< Configure to generate interrupt if VBAT in Region1 */
  PMG_IEN_REGION2 = 1,  /**< Configure to generate interrupt if VBAT in Region2 */
  PMG_IEN_REGION3 = 2,  /**< Configure to generate interrupt if VBAT in Region3 */
  PMG_IEN_NA      = 3   /**< NA                                                 */
} ADI_PMG_IEN_RANGEBAT;


/* ==========================================================================
 *! \struct ADI_PMG_IEN_Struct
 *! \brief  Power Supply Monitor Interrupt Enable Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_PMG_IEN_t__
typedef struct _ADI_PMG_IEN_t {
  union {
    struct {
      unsigned int VBAT       :  1;  /**< Enable Interrupt for VBAT */
      unsigned int VREGUNDR   :  1;  /**< Enable Interrupt when VREG under-voltage (below 1 V) */
      unsigned int VREGOVR    :  1;  /**< Enable Interrupt when VREG over-voltage (above 1.32 V) */
      unsigned int reserved3  :  5;
      unsigned int RANGEBAT   :  2;  /**< Battery Monitor Range */
      unsigned int IENBAT     :  1;  /**< Interrupt enable for VBAT range */
      unsigned int reserved11 : 21;
    };
    uint32_t VALUE32;
  };
} ADI_PMG_IEN_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_PMG_IEN_t__ */

/*@}*/

/** @defgroup PSM_STAT Power Supply Monitor Status (PSM_STAT) Register
 *  Power Supply Monitor Status (PSM_STAT) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_PMG_PSM_STAT_RORANGE1
 *! \brief  VBAT range1 (RORANGE1) Enumerations
 *  ========================================================================= */
typedef enum
{
  PMG_PSM_STAT_BATSTAT1 = 0,  /**< VBAT NOT in the range specified */
  PMG_PSM_STAT_BATSTAT0 = 1   /**< VBAT in the range specified     */
} ADI_PMG_PSM_STAT_RORANGE1;


/* ==========================================================================
 *! \struct ADI_PMG_PSM_STAT_Struct
 *! \brief  Power Supply Monitor Status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_PMG_PSM_STAT_t__
typedef struct _ADI_PMG_PSM_STAT_t {
  union {
    struct {
      unsigned int VBATUNDR   :  1;  /**< Status bit indicating an Alarm that battery is below 1.8 V */
      unsigned int VREGUNDR   :  1;  /**< Status bit for Alarm indicating VREG is below 1 V */
      unsigned int VREGOVR    :  1;  /**< Status bit for alarm indicating Over Voltage for VREG */
      unsigned int reserved3  :  4;
      unsigned int WICENACK   :  1;  /**< WIC Enable Acknowledge from Cortex */
      unsigned int RANGE1     :  1;  /**< VBAT range1 */
      unsigned int RANGE2     :  1;  /**< VBAT range2 */
      unsigned int RANGE3     :  1;  /**< VBAT range3 */
      unsigned int reserved11 :  2;
      unsigned int RORANGE1   :  1;  /**< VBAT range1 */
      unsigned int RORANGE2   :  1;  /**< VBAT range2 */
      unsigned int RORANGE3   :  1;  /**< VBAT range3 */
      unsigned int reserved16 : 16;
    };
    uint32_t VALUE32;
  };
} ADI_PMG_PSM_STAT_t;
