sfproductlabs/ADuCM350/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM350/bsp/sys/adi_ADuCM350_typedefs.h
/* ==========================================================================
 *! \struct ADI_XINT_NMICLR_Struct
 *! \brief  Non-maskable interrupt clear Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_XINT_NMICLR_t__
typedef struct _ADI_XINT_NMICLR_t {
  union {
    struct {
      unsigned int CLR        :  1;  /**< NMI clear */
      unsigned int reserved1  : 31;
    };
    uint32_t VALUE32;
  };
} ADI_XINT_NMICLR_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_XINT_NMICLR_t__ */

/*@}*/

/** @defgroup KEY Key Protection for OSCCTRL (KEY) Register
 *  Key Protection for OSCCTRL (KEY) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CLKG_OSC_KEY_Struct
 *! \brief  Key Protection for OSCCTRL Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CLKG_OSC_KEY_t__
typedef struct _ADI_CLKG_OSC_KEY_t {
  union {
    struct {
      unsigned int VALUE      : 16;  /**< Oscillator key */
      unsigned int reserved16 : 16;
    };
    uint32_t VALUE32;
  };
} ADI_CLKG_OSC_KEY_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CLKG_OSC_KEY_t__ */

/*@}*/

/** @defgroup CTL Oscillator Control (CTL) Register
 *  Oscillator Control (CTL) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CLKG_OSC_CTL_Struct
 *! \brief  Oscillator Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CLKG_OSC_CTL_t__
typedef struct _ADI_CLKG_OSC_CTL_t {
  union {
    struct {
      unsigned int LFCLK_MUX  :  1;  /**< 32 kHz clock select mux */
      unsigned int HFOSC_EN   :  1;  /**< High frequency internal oscillator enable */
      unsigned int LFX_EN     :  1;  /**< Low frequency crystal oscillator enable */
      unsigned int HFX_EN     :  1;  /**< High frequency crystal oscillator enable */
      unsigned int LFX_BYP    :  1;  /**< Low frequency crystal oscillator Bypass */
      unsigned int LFX_MON_EN :  1;  /**< LFXTAL clock monitor and Clock FAIL interrupt enable */
      unsigned int reserved6  :  2;
      unsigned int LFOSC_OK   :  1;  /**< Status of LFOSC oscillator */
      unsigned int HFOSC_OK   :  1;  /**< Status of HFOSC oscillator */
      unsigned int LFX_OK     :  1;  /**< Status of LFXTAL oscillator */
      unsigned int HFX_OK     :  1;  /**< Status of HFXTAL oscillator */
      unsigned int LFX_AUTSW_EN :  1;  /**< Enables automatic Switching of the LF Mux to LFOSC on LFXTAL Failure */
      unsigned int LFX_AUTSW_STA :  1;  /**< Status of automatic switching of the LF Mux to LFOSC upon detection of LFXTAL failure */
      unsigned int LFX_ROBUST_EN :  1;  /**< LFXTAL Mode select */
      unsigned int LFX_ROBUST_LD :  2;  /**< LFXTAL Robust Mode Load select */
      unsigned int reserved17    :  3;
      unsigned int ROOT_MON_EN   :  1;  /**< ROOT clock monitor and Clock FAIL interrupt enable */
      unsigned int ROOT_AUTSW_EN :  1;  /**< Enables automatic Switching of the Root clock  to HFOSC on Root clock Failure */
      unsigned int ROOT_AUTSW_STA :  1;  /**< Status of automatic switching of the Root clock to HFOSC upon detection of Root clock failure */
      unsigned int reserved23     :  7;
      unsigned int ROOT_FAIL_STA  :  1;  /**< Root clock (crystal clock) Not Stable */
      unsigned int LFX_FAIL_STA   :  1;  /**< LF XTAL (crystal clock) Not Stable */
    };
    uint32_t VALUE32;
  };
} ADI_CLKG_OSC_CTL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CLKG_OSC_CTL_t__ */

/*@}*/

/** @defgroup SRAM_CTL Control for SRAM Parity and Instruction SRAM (SRAM_CTL) Register
 *  Control for SRAM Parity and Instruction SRAM (SRAM_CTL) Register.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_PMG_TST_SRAM_CTL_Struct
 *! \brief  Control for SRAM Parity and Instruction SRAM Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_PMG_TST_SRAM_CTL_t__
typedef struct _ADI_PMG_TST_SRAM_CTL_t {
  union {
    struct {
      unsigned int reserved0  :  1;
      unsigned int BNK1EN     :  1;  /**< Enable initialization */
      unsigned int BNK2EN     :  1;  /**< Enable initialization */
      unsigned int reserved3  :  4;
      unsigned int BNK7EN     :  1;  /**< Enable initialization */
      unsigned int reserved8  :  5;
      unsigned int STARTINIT  :  1;  /**< Write one to trigger initialization. Self-cleared */
      unsigned int AUTOINIT   :  1;  /**< Automatic initialization on wake up from hibernate mode */
      unsigned int ABTINIT    :  1;  /**< Abort current initialization. Self-cleared */
      unsigned int PENBNK0    :  1;  /**< Enable parity check */
      unsigned int PENBNK1    :  1;  /**< Enable parity check */
      unsigned int PENBNK2    :  1;  /**< Enable parity check */
      unsigned int PENBNK3    :  1;  /**< Enable parity check */
      unsigned int PENBNK4    :  1;  /**< Enable parity check */
      unsigned int PENBNK5    :  1;  /**< Enable parity check */
      unsigned int PENBNK6    :  1;  /**< Enable parity check */
      unsigned int PENBNK7    :  1;  /**< Enable parity check */
      unsigned int reserved24 :  7;
      unsigned int INSTREN    :  1;  /**< Enables 32 KB instruction SRAM */
    };
    uint32_t VALUE32;
  };
} ADI_PMG_TST_SRAM_CTL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_PMG_TST_SRAM_CTL_t__ */

/*@}*/

/** @defgroup SRAM_INITSTAT Initialization Status Register (SRAM_INITSTAT) Register
 *  Initialization Status Register (SRAM_INITSTAT) Register.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_PMG_TST_SRAM_INITSTAT_BNK0DONE
 *! \brief  Bank 0 initialization status (BNK0DONE) Enumerations
 *  ========================================================================= */
typedef enum
{
  PMG_TST_SRAM_INITSTAT_NO_BANK0_INIT = 0,  /**< Bank 0 not initialized */
  PMG_TST_SRAM_INITSTAT_BANK0_INIT    = 1   /**< Bank 0 initialized     */
} ADI_PMG_TST_SRAM_INITSTAT_BNK0DONE;


/*  =========================================================================
 *! \enum   ADI_PMG_TST_SRAM_INITSTAT_BNK1DONE
 *! \brief  Bank 1 initialization status (BNK1DONE) Enumerations
 *  ========================================================================= */
typedef enum
{
  PMG_TST_SRAM_INITSTAT_NO_BANK1_INIT = 0,  /**< Bank 1 not initialized */
  PMG_TST_SRAM_INITSTAT_BANK1_INIT    = 1   /**< Bank 1 initialized     */
} ADI_PMG_TST_SRAM_INITSTAT_BNK1DONE;


/*  =========================================================================
 *! \enum   ADI_PMG_TST_SRAM_INITSTAT_BNK2DONE
 *! \brief  Bank 2 initialization status (BNK2DONE) Enumerations
 *  ========================================================================= */
typedef enum
{
  PMG_TST_SRAM_INITSTAT_NO_BANK2_INIT = 0,  /**< Bank 2 not initialized */
  PMG_TST_SRAM_INITSTAT_BANK2_INIT    = 1   /**< Bank 2 initialized     */
} ADI_PMG_TST_SRAM_INITSTAT_BNK2DONE;


/*  =========================================================================
 *! \enum   ADI_PMG_TST_SRAM_INITSTAT_BNK3DONE
 *! \brief  Bank 3 initialization status (BNK3DONE) Enumerations
 *  ========================================================================= */
typedef enum
{
  PMG_TST_SRAM_INITSTAT_NO_BANK3_INIT = 0,  /**< Bank 3 not initialized */
  PMG_TST_SRAM_INITSTAT_BANK3_INIT    = 1   /**< Bank 3 initialized     */
} ADI_PMG_TST_SRAM_INITSTAT_BNK3DONE;


/*  =========================================================================
 *! \enum   ADI_PMG_TST_SRAM_INITSTAT_BNK4DONE
 *! \brief  Bank 4 initialization status (BNK4DONE) Enumerations
 *  ========================================================================= */
typedef enum
{
  PMG_TST_SRAM_INITSTAT_NO_BANK4_INIT = 0,  /**< Bank 4 not initialized */
  PMG_TST_SRAM_INITSTAT_BANK4_INIT    = 1   /**< Bank 4 initialized     */
} ADI_PMG_TST_SRAM_INITSTAT_BNK4DONE;


/*  =========================================================================
 *! \enum   ADI_PMG_TST_SRAM_INITSTAT_BNK5DONE
 *! \brief  Bank 5 initialization status (BNK5DONE) Enumerations
 *  ========================================================================= */
typedef enum
{
  PMG_TST_SRAM_INITSTAT_NO_BANK5_INIT = 0,  /**< Bank 5 not initialized */
  PMG_TST_SRAM_INITSTAT_BANK5_INIT    = 1   /**< Bank 5 initialized     */
} ADI_PMG_TST_SRAM_INITSTAT_BNK5DONE;


/*  =========================================================================
 *! \enum   ADI_PMG_TST_SRAM_INITSTAT_BNK6DONE
 *! \brief  Bank 6 initialization status (BNK6DONE) Enumerations
 *  ========================================================================= */
typedef enum
{
  PMG_TST_SRAM_INITSTAT_NO_BANK6_INIT = 0,  /**< Bank 6 not initialized */
  PMG_TST_SRAM_INITSTAT_BANK6_INIT    = 1   /**< Bank 6 initialized     */
} ADI_PMG_TST_SRAM_INITSTAT_BNK6DONE;


/*  =========================================================================
 *! \enum   ADI_PMG_TST_SRAM_INITSTAT_BNK7DONE
 *! \brief  Bank 7 initialization status (BNK7DONE) Enumerations
 *  ========================================================================= */
typedef enum
{
  PMG_TST_SRAM_INITSTAT_NO_BANK7_INIT = 0,  /**< Bank 7 not initialized */
  PMG_TST_SRAM_INITSTAT_BANK7_INIT    = 1   /**< Bank 7 initialized     */
} ADI_PMG_TST_SRAM_INITSTAT_BNK7DONE;


